Repository: ZakariaAshraf/Tanzimak
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Tanzimak
ar: تنظيمك

# buildYourPerfectSchedule
source: Build your perfect university schedule without the stress.
ar: قم ببناء جدولك الجامعي المثالي دون ضغط.

source: Get Started
ar: ابدأ الآن

source: Add Courses
ar: إضافة المواد

# addCoursesDescription
source: [+] Add all the courses available to you this semester. We will find the best combinations for you.
ar: [+] أضف جميع المواد المتاحة لك هذا الفصل. سنجد لك أفضل التركيبات.

source: [+] ADD NEW COURSE
ar: [+] إضافة مادة جديدة

# generateSchedulesWithoutNumber
source: GENERATE SCHEDULES
ar: إنشاء الجداول

source: Generating Schedule Suggestions
ar: جاري تحميل الجداول المقترحه

# generateSchedules
source: GENERATE SCHEDULES ({count})
ar: إنشاء الجداول ({count})

source: Add Course
ar: إضافة مادة

source: Course Name
ar: اسم المادة

# courseNameHint
source: e.g. Introduction to Programming
ar: مثال: مقدمة في البرمجة

source: Course Code
ar: رمز المادة

# courseCodeHint
source: e.g. CS101
ar: مثال: CS101

source: Course Hours
ar: ساعات المادة

# courseHoursHint
source: e.g. 3
ar: مثال: 3

source: Course Timings
ar: أوقات المادة

source: Add another Timing
ar: إضافة وقت آخر

source: Save Course
ar: حفظ المادة

# pleaseAddTiming
source: Please add at least one course timing.
ar: يرجى إضافة وقت واحد على الأقل للمادة.

# pleaseEnterValidHours
source: Please enter a valid number for course hours.
ar: يرجى إدخال رقم صحيح لساعات المادة.

source: Day of the Week
ar: يوم الأسبوع

source: Start Time
ar: وقت البداية

source: End Time
ar: وقت النهاية

source: Save Schedule
ar: حفظ الجدول

# endTimeMustBeAfterStart
source: End time must be after start time.
ar: يجب أن يكون وقت النهاية بعد وقت البداية.

# hours
source: hrs
ar: ساعات

source: Schedule Preferences
ar: تفضيلات الجدول

source: Desired Credit Hours Range
ar: نطاق الساعات المطلوبة

# hoursRange
source: {start} - {end} hours
ar: {start} - {end} ساعة

source: Preferred Days Off
ar: الأيام المفضلة للإجازة

# choosePreferredDaysOff
source: Choose your preferred days off.
ar: اختر أيام الإجازة المفضلة لديك.

source: Monday
ar: الاثنين

source: Tuesday
ar: الثلاثاء

source: Wednesday
ar: الأربعاء

source: Thursday
ar: الخميس

source: Friday
ar: الجمعة

source: Saturday
ar: السبت

source: Sunday
ar: الأحد

source: Suggested Schedules
ar: الجداول المقترحة

# scheduleOf
source: Schedule {current} of {total}
ar: الجدول {current} من {total}

# totalCredits
source: Total Credits: {credits}
ar: إجمالي الساعات: {credits}

source: No schedules to display.
ar: لا توجد جداول للعرض.
